Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/josm-tm.tmx
Source language: en
Languages: ca_es

source: Use default (and maybe existing) GnuPG directory ({0}) to store new keys and configs.
ca_es: Utilitza el directori predefinit (i potser existent) de GnuPG ({0}) per enregistrar les noves claus i configuracions.

source: Use separate GnuPG directory ({0}) to store new keys and configs.
ca_es: Utilitza un directori de GnuPG separat ({0}) per enregistrar les noces claus i configuracions.

source: Trust OSM Settings
ca_es: Ajustar paràmetres de confiança OSM

source: Change GPG and privacy settings of the trustosm plugin.
ca_es: Canvia els paràmetres de GPG i de privacitat del connector ''trustosm''.

source: Use separate GnuPG configuration directory?
ca_es: Utilitzar un directori separat per la configuració GnuPG?

source: Dialog
ca_es: Diàleg

source: Signed key value pair was: {0}={1}
ca_es: La parella signada clau-valor era: {0}={1}

source: {0} Signatures found.
ca_es: {0} Signatures trobades.

source: Signature Info
ca_es: Informació de la signatura

source: Sorry, there are no Signatures for the selected Node.
ca_es: No hi ha signatures per al node seleccionat.

source: No Signature found
ca_es: No s''ha trobat cap signatura

source: Selected node was: {0}
ca_es: el node seleccionat fou: {0}

source: Sorry, there are no Signatures for the selected Attribute.
ca_es: Ho sentim, no hi ha signatures per a l''atribut seleccionat.

source: Selected key value pair was: {0}={1}
ca_es: La parella clau-valor seleccionada era: {0}={1}

source: Sorry, there are no Signatures for the selected Segment.
ca_es: Ho sentim, no hi ha signatures per al segment seleccionat.

source: Selected WaySegment was:
ca_es: El segment de via seleccionat era :

source: Signature Files
ca_es: Fitxer de signatures

source: OSM Signature Files
ca_es: Fitxer de signatures OSM

source: Only digits allowed in osmid: ''{0}''.
ca_es: Només s''admeten nombres com a identificadors osm: ''{0}''.

source: Could not parse OpenPGP message.
ca_es: No és possible l''anàlisi del missatge OpenPGP

source: Prepare stuff...
ca_es: Preparant...

source: Parsing Signature data...
ca_es: Analitzant les dades de la signatura...

source: The Signature is broken!
ca_es: La signatura està trencada!

source: Manipulation Warning
ca_es: Avís de manipulació

source: Select a signing key from your keyring-file:
ca_es: Seleccioneu una clau de signatura del vostre fitxer:

source: Don''t ask again for the key
ca_es: No tornar a demanar per la clau

source: Use a random key from this list
ca_es: Utilitzar una clau aleatòria per a aquesta llista

source: Create new Key
ca_es: Crea una clau nova

source: Select a Key to sign
ca_es: Seleccionar una clau per signar

source: The object with the ID "{0}" ({1}) is newly created. You can not sign it, because the signature would lose the ID-Reference after uploading it to the OSM-server.
ca_es: L''objecte amb l''ID "{0}" ({1}) acaba de ser creat. No el podeu signar perquè la signatura perdrà l''ID de referència després de ser enviada al servidor OSM.

source: Signing canceled!
ca_es: Signatura cancel·lada!

source: Please give a tolerance in meters
ca_es: Si us plau indiqueu un tolerància en metres

source: Select as much as you like:
ca_es: Seleccioneu tant com vulgueu:

source: Survey
ca_es: Enquesta

source: Aerial Photography
ca_es: Fotografia aèria

source: Web Recherche
ca_es: Recerca web

source: Trusted persons told me
ca_es: Informació d''una persona de confiança

source: Which source did you use?
ca_es: Quina font heu utilitzat?

source: never
ca_es: mai

source: Primary user-ID:
ca_es: ID d''usuari/a primari:

source: Key-ID:
ca_es: ID de la clau:

source: Fingerprint:
ca_es: Empremta digital:

source: Algorithm:
ca_es: Algorisme:

source: Strength in bit:
ca_es: Força en bits:

source: Creation date:
ca_es: Data de creació:

source: Expiration date:
ca_es: Data de venciment:

source: PGP-Key details
ca_es: Detalls de la clau PGP

source: User-ID:
ca_es: Identificador d''usuari/a:

source: Select algorithm:
ca_es: Seleccioneu un algorisme:

source: Choose Bitlength (Strength):
ca_es: Seleccioneu un longitud binaria (força):

source: Encryption algorithm to protect private key:
ca_es: Algorisme d''encriptació per a protegir la vostra clau privada:

source: Choose an expiry date for the key:
ca_es: Escolliu una data d''expiració per a la clau:

source: Create a new signing key
ca_es: Crear una nova clau de signatura

source: No such lane.
ca_es: No existeix el carril

source: <html>The number of lanes is not specified for one or more roads; please add missing lanes tags.</html>
ca_es: <html>El nombre de carrils no ha estat especificat per una o més carreteres; si us plau afegiu les etiquetes de carril que manquen.</html>

source: <html>An error occurred while constructing the model. Please run the validator to make sure the data is consistent.<br><br>Error: {0}</html>
ca_es: <html>Ha hagut un error durant la construcció del model. Si us plau inicieu el validador per assegurar-vos de la consistència de les dades.<br><br>Error: {0}</html>

source: Edit turn relations and lane lengths for selected node.
ca_es: Modificar les relacions de gir i les longituds dels carrils per al node seleccionat.

source: Validate turn- and lane-length-relations for consistency.
ca_es: Valida les relacions "turn" (gir) i "lane-length" (longitud de carril) per assegurar la coherencia.

source: Turn Lanes
ca_es: Carrils de gir

source: Edit turn lanes
ca_es: Modificar carrils de gir

source: Quick-Fix
ca_es: Correcció ràpida

source: Revalidate all turnlanes-relations.
ca_es: Revalidar totes les relacions de vies de gir

source: Automatically fixes the issue.
ca_es: Corregeix el problema automàticament.

source: Selects the offending relation.
ca_es: Selecciona la relació implicada.

source: Add turn
ca_es: Afegeix un gir

source: Delete lane.
ca_es: Suprimeix el carril

source: Delete turn.
ca_es: Suprimeix el gir

source: {0} lanes are not referenced in any turn-relation.
ca_es: {0} carrils no són referenciats a cap relació de gir.

source: Put the ways in order.
ca_es: Ordenar les vies.

source: Relation references non-existent (regular) lane {0}
ca_es: La relació conté una referència a un carril {0} inexistent

source: Relation references non-existent extra lane {0}
ca_es: La relació conté una referència a un carril addicional {0} inexistent

source: Integer list "{0}" contains unexpected values.
ca_es: La llista d''enters ''{0}'' conté valors inesperats.

source: Create/Edit turn restriction...
ca_es: Crear/Modificar una prohibició de gir ...

source: Create or edit a turn restriction.
ca_es: Crear o modificar una prohibició de gir.

source: In the following table you can edit the <strong>raw members</strong> of the OSM relation representing this turn restriction.
ca_es: A la taula següent podeu modificar els <strong>membres</strong> de la relació OSM que representen aquesta prohibició de gir.

source: Type:
ca_es: Tipus:

source: From:
ca_es: De:

source: To:
ca_es: A:

source: Vias:
ca_es: Objectes via:

source: Copy to the clipboard
ca_es: Copia-ho al porta-retalls

source: Cannot find object with id ''{0}'' in layer ''{1}''
ca_es: No es pot trobar l''objecte amb l''id ''{0}'' a la capa ''{1}''

source: Cannot add object ''{0}'' as relation member because it is deleted or invisible in layer ''{1}''
ca_es: No és possible d''afegir l''objecte ''{0}'' com a membre de la relació perquè està esborrat a la capa no visible ''{1}''

source: Clear the selected roles or delete the selected members
ca_es: Suprimeix els nodes o els membres seleccionats

source: Insert new relation members from object in the clipboard
ca_es: Afegir nous membres de la relació a partir dels objectes del porta-retalls

source: Move the selected relation members down by one position
ca_es: Moure avall els membres de la relació seleccionats una posició

source: Move the selected relation members up by one position
ca_es: Moure una posició amunt els membres de la relació seleccionats

source: Edit basic attributes of a turn restriction
ca_es: Modificar els atributs bàsics d''una prohibició de gir

source: Edit the raw tags and members of this turn restriction
ca_es: Modificar les etiquetes i els membres d''aquesta prohibició de gir

source: Errors/Warnings
ca_es: Errors/Avisos

source: Show errors and warnings related to this turn restriction
ca_es: Mostrar els errors i els avisos relacionats amb aquesta prohibició de gir

source: Create a new turn restriction in layer ''{0}''
ca_es: Crear una nova prohibició de gir a la capa ''{0}''

source: Edit a new turn restriction in layer ''{0}''
ca_es: Modificar una nova prohibició de gir a la capa ''{0}''

source: Edit turn restriction ''{0}'' in layer ''{1}''
ca_es: Modificar la prohibició de gir ''{0}'' a la capa ''{1}''

source: There is still an unresolved error or warning identified for this turn restriction. You are recommended to resolve this issue first.
ca_es: Encara hi ha un error o un avís per resoldre en aquesta prohibició de gir. Es recomana de resoldre primer aquest problema.

source: Do you want to save anyway?
ca_es: Voleu enregistrar-ho de totes maneres?

source: Yes, save anyway
ca_es: Si, enregistrar malgrat tot

source: Save the turn restriction despite of errors and/or warnings
ca_es: Enregistrar la prohibició de gir malgrat els errors i els avisos

source: No, resolve issues first
ca_es: No, resoldre primer els problemes

source: Cancel saving and start resolving pending issues first
ca_es: Anular l''enregistrament i començar a resoldre els problemes

source: Pending errors and warnings
ca_es: Errors i avisos pendents

source: This turn restriction refers to an object which was deleted outside of this turn restriction editor:
ca_es: Aquesta prohibició de gir es refereix a un objecte que ha estat esborrat fora d''aquest editor de prohibicions:

source: Updates to this turn restriction can''t be saved unless deleted members are removed.<br>How to you want to proceed?
ca_es: L''actualització d''aquesta prohibició de gir no pot ser enregistrada si els membres esborrats no s''eliminen.<br>Com voleu procedir?

source: Remove deleted members and save
ca_es: Eliminar els membres suprimits i enregistrar

source: Cancel and return to editor
ca_es: Cancel·lar i tornar a l''editor

source: Deleted members in turn restriction
ca_es: Membres suprimits de la prohibició de gir

source: Create a conflict and close this turn restriction editor
ca_es: Crear un conflicte i tancar l''editor

source: Return to the turn restriction editor and resume editing
ca_es: Tornar a la prohibició de gir i reprendre les modificacions

source: <html>This turn restriction has been changed outside of the editor.<br>You cannot apply your changes and continue editing.<br><br>Do you want to create a conflict and close the editor?</html>
ca_es: <html>Aquesta prohibició de gir ha estat modificada fora de l''editor.<br>No podeu aplicar els vostres canvisi continuar editant.<br><br>Voleu crear un conflicte i tancar l''editor?</html>

source: Already participating in a conflict
ca_es: Ja participen a un conflicte

source: Delete this turn restriction
ca_es: Suprimir aquesta prohibició de gir

source: Select this turn restriction
ca_es: Seleccionar aquesta prohibició de gir

source: Activate the layer this turn restriction belongs to and zoom to it
ca_es: Activa la capa que conté aquesta prohibició de gir i es posiciona i amplia la seva zona.

source: {0} warning
ca_es: {0} avís

source: no issues
ca_es: cap problema

source: please select a way
ca_es: si us plau seleccioneu una via

source: multiple objects with role ''{0}''
ca_es: múltiples objectes amb el rol ''{0}''

source: Delete from turn restriction
ca_es: Suprimir de la prohibició de gir

source: Accept the currently selected way
ca_es: Acceptar la via seleccionada

source: Paste from the clipboard
ca_es: Enganxa el contingut del porta-retalls

source: Create new turn restriction
ca_es: Crear una nova prohibició de gir

source: Launch the turn restriction editor to create a new turn restriction
ca_es: Obre l''editor de prohibicions de gir per crear-ne una de nova

source: No Right Turn
ca_es: Prohibició de girar a la dreta

source: No Left Turn
ca_es: Prohibició de girar a l''esquerra

source: No U-Turn
ca_es: Prohibició de fer un canvi de sentit

source: No Straight On
ca_es: Prohibició de continuar recte

source: Only Right Turn
ca_es: Obligació de girar a la dreta

source: Only Left Turn
ca_es: Obligació de girar a l''esquerra

source: Only Straight On
ca_es: Obligació de continuar recte

source: Warning: failed to load icon for turn restriction type ''{0}''
ca_es: Avís: ha fallat la càrrega de la icona per la prohibició de gir de tipus ''{0}''

source: please select a turn restriction type
ca_es: si us plau seleccioneu un tipus de prohibició de gir

source: Select the vehicle types this turn restriction is <strong>not</strong> applicable for.
ca_es: Seleccioneu el tipus de vehicle per als que aquesta prohibició de gir <strong>no</strong> és aplicable

source: Public Service Vehicles
ca_es: Vehicles de servei públic

source: Public service vehicles like buses, tramways, etc.
ca_es: Vehicles de servei públic com autobusos, tramvies, etc.

source: Heavy Goods Vehicles
ca_es: Vehicles pesants de mercaderies

source: Motorcars
ca_es: Automòbils

source: Bicycles
ca_es: Bicicletes

source: Use standard exceptions
ca_es: Utilitzar les excepcions estàndards

source: Use non-standard exceptions
ca_es: Utilitzar les excepcions no estàndards

source: Remove the currently selected vias
ca_es: Suprimir les vies seleccionades

source: Move the selected vias down by one position
ca_es: Mou avall una posició els objectes via seleccionats

source: Move the selected vias up by one position
ca_es: Mou amunt una posició els objectes via seleccionats

source: Copy the selected vias to the clipboard
ca_es: Copia els objectes via seleccionats al portaretalls

source: Insert ''via'' objects from the clipboard
ca_es: Insereix els objectes ''via'' del portaretalls

source: Failed to retrieve OSM object with id {0} from dataset {1}. Cannot add it as ''via''.
ca_es: Ha fallat la recuperació de l''objecte amb id {0} del conjunt de dades {1}. No podrà ser afegit com a objecte ''via''.

source: no participating way with role ''from''
ca_es: cap via amb el rol ''from''

source: no participating way with role ''to''
ca_es: cap via amb el rol ''to''

source: Only participating in selection
ca_es: Només participants a la selecció

source: <html>Select to display turn restrictions related to object in the current selection only.<br>Deselect to display all turn restrictions in the current data set.</html>
ca_es: <html>Seleccioneu per mostrar les prohibicions de gir relacionades amb els objectes seleccionats.<br>Deseleccioneu per mostrar les prohibicions de gir del tot el conjunt de dades.</html>

source: Turn Restrictions
ca_es: Prohibicions de gir

source: Display and manage turn restrictions in the current data set
ca_es: Mostrar i gestionar les prohibicions de gir del conjunt de dades

source: Open an editor for the selected turn restriction
ca_es: Obre un editor per la prohibició de gir seleccionada

source: Delete the selected turn restriction
ca_es: Suprimeix la prohibició de gir seleccionada

source: Create a new turn restriction
ca_es: Crear una nova prohibició de gir

source: Set the current JOSM selection to the selected turn restrictions
ca_es: Definir la selecció JOSM sobre les prohibicions de gir seleccionades

source: Select in current data layer
ca_es: Seleccionar a la capa actual

source: Zoom to the currently selected turn restrictions
ca_es: Amplia la zona de la prohibició de gir seleccionada

source: An OSM plugin for editing turn restrictions.
ca_es: Un connector OSM per editar les prohibicions de gir

source: Development of the turn restriction plugin was sponsored by <a href="http://www.skobbler.de">skobbler GmbH</a>.
ca_es: El desenvolupament del connector per a gestionar les prohibicions de gir ha estat patrocinat per <a href="http://www.skobbler.de">skobbler GmbH</a>.

source: Configure the preferences for the turnrestrictions plugin
ca_es: Configurar les preferències per al connector d''edició de prohibicions de gir.

source: Sponsor
ca_es: Patrocinador

source: The Basic Editor can optionally display the list of via-objects of a turn restriction. If enabled, one can edit them in the Basic editor too. If disabled, editing of via-objects is possible in the Advanced Editor only.
ca_es: L''editor bàsic pot mostrar la llista d''objectes ''via'' d''una prohibició de gir. Si l''opció ha estat activada, també podrà ser utilitzat per fer modificacions, en cas contrari només es podran editar els objectes "via" amb l''editor avançat.

source: Display and edit list of via-objects in the Basic Editor
ca_es: Mostra i modifica la llista d''objectes ''via'' a l''editor bàsic

source: Road signs - Set A
ca_es: Senyals de trànsit-Grup A

source: Road signs - Set B
ca_es: Senyals de trànsit-Grup B

source: Please select the set of road sign icons to be used in the plugin.
ca_es: Si us plau seleccioneu un grup de senyals de trànsit per ser utilitzades pel connector.

source: Warning: the preference with key ''{0}'' has an unsupported value ''{1}''. Assuming the default value ''set-a''.
ca_es: Avís: la preferència amb la clau ''{0}'' te un valor ''{1}'' no admés. S''assumeix el valor "grup a".

source: This turn restriction uses the way <span class="object-name">{0}</span> with role <tt>from</tt> <strong>and</strong> with role <tt>to</tt>. In a turn restriction, the way with role <tt>from</tt> should be different from the way with role <tt>to</tt>, though.
ca_es: Aquesta prohibició de gir utilitza la via <span class="object-name">{0}</span> amb el rol <tt>from</tt> <strong>i</strong> amb el rol <tt>to</tt>. A una prohibició de gir, la via amb el rol <tt>from</tt> ha de ser diferent de la via que fa el rol <tt>to</tt>.

source: Delete ''from''
ca_es: Suprimeix de

source: Removes the member with role ''from''
ca_es: Suprimir els membres amb el rol ''from''

source: Delete ''to''
ca_es: Suprimir ''to''

source: Removes the member with role ''to''
ca_es: Suprimir els membres amb el rol ''to''

source: Fix in editor
ca_es: Corregir a l''editor

source: Go to Basic Editor and manually choose members with roles ''from'' and ''to''
ca_es: Anar a l''editor bàsic i escollir manualment membres amb rols ''from'' i ''to''

source: This turn restriction uses a non-standard restriction type <tt>{0}</tt> for the tag key <tt>restriction</tt>. It is recommended to use standard values only. Please select one in the Basic editor.
ca_es: Aquesta prohibició de gir utilitza un tipus no estàndard de prohibició <tt>{0}</tt> per a l''etiqueta de la clau <tt>restriction</tt> (prohibició). Es recomana d''utilitzar només valors estàndards Si us plau, seleccioneu-ne un a l''editor bàsic.

source: Go to Basic Editor and manually choose a turn restriction type
ca_es: Anar a l''editor bàsic i escollir manualment un tipus de prohibició

source: The <strong>from</strong>-way <span class="object-name">{0}</span> and the <strong>to</strong>-way <span class="object-name">{1}</span> intersect at node <span class="object-name">{2}</span> but this node isn''t a <strong>via</strong>-object.<br> It is recommended to set it as unique <strong>via</strong>-object.
ca_es: La via <strong>from</strong> <span class="object-name">{0}</span> i la via <strong>to</strong> <span class="object-name">{1}</span> es creuen al node <span class="object-name">{2}</span> però aquest node no és un objecte de tipus <strong>via</strong>.<br> Es recomana de convertir-lo en un objecte <strong>via</strong> únic.

source: Set via-Object
ca_es: Establir objecte via

source: Replaces the currently configured via-objects with the node at the intersection
ca_es: Reemplaça els objectes via configurats amb el node de la intersecció

source: Go to Basic Editor and manually fix the list of via-objects
ca_es: Anar a l''editor bàsic i corregir manualment la llista d''objectes via

source: A turn restriction must declare the type of restriction. Please select a type in the Basic Editor.
ca_es: Una prohibició de gir ha de tenir declarat un tipus de prohibició. Si us plau seleccioneu un tipus a l''editor bàsic.

source: A way with role <tt>from</tt> is required in a turn restriction.
ca_es: Cal una via amb el rol <tt>from</tt> a una prohibició de gir.

source: A way with role <tt>to</tt> is required in a turn restriction.
ca_es: Cal una via amb el rol <tt>to</tt> a una prohibició de gir.

source: Please go to the Basic editor and manually choose a way.
ca_es: Si us plau, aneu a l''editor bàsic i seleccioneu una via manualment

source: Add in editor
ca_es: Afegir a l''editor

source: Add a way with role ''from''
ca_es: Afegeix una via amb el rol ''from''

source: Add a way with role ''to''
ca_es: Afegeix una via amb el rol ''to''

source: The two ways participating in the turn restriction <strong>aren''t connected.</strong>
ca_es: Les dues vies que formen part de la prohibició de gir <strong>no són interconnectades</strong>

source: Make sure you add one or more via objects (nodes or ways) to the turn restriction.
ca_es: Assegureu-vos que heu afegit un o més objectes via (nodes o vies) a la prohibició de gir

source: Go to the Advanced Editor and add via objects
ca_es: Anar a l''editor avançat i afegir objectes via

source: A turn restriction requires exactly one way with role <tt>from</tt>. This turn restriction has {0} ways in this role. Please remove {1} of them.
ca_es: Una prohibició de gir requereix una única via amb el rol <tt>from</tt>. Aquesta prohibició de gir te {0} vies amb aquest rol. Si us plau suprimiu {1}.

source: A turn restriction requires exactly one way with role <tt>to</tt>. This turn restriction has {0} ways in this role. Please remove {1} of them.
ca_es: Una prohibició de gir requereix una única via amb el rol <tt>to</tt>. Aquesta prohibició de gir te {0} vies amb aquest rol. Si us plau suprimiu {1}.

source: Go to the Advanced Editor and remove the members
ca_es: Anar a l''editor avançat i suprimir els membres

source: The tag <tt>except</tt> has the non-standard value <tt>{0}</tt>. It is recommended to use standard values for <tt>except</tt> only.
ca_es: L''etiqueta <tt>except</tt> te un valor no estàndard <tt>{0}</tt>. Es recomana d''utilitzar només valors estàndars per <tt>except</tt>.

source: Go to Basic Editor and select standard vehicle type based exceptions
ca_es: Anar a l''editor bàsic i seleccionar un tipus estàndard de prohibició en funció del vehicle

source: The required tag <tt>{0}={1}</tt> is missing.
ca_es: Manca l''etiqueta requerida <tt>{0}={1}</tt>.

source: Add missing tag
ca_es: Afegeix etiqueta que manca

source: Add the missing tag {0}={1}
ca_es: Afegeix l''etiqueta {0}={1} que manca

source: The way <span class="object-name">{0}</span> with role <tt>from</tt> and the way <span class="object-name">{1}</span> with role <tt>to</tt> intersect at node <span class="object-name">{2}</span>. <p> Both ways should be split at the intersecting node.
ca_es: La via <span class="object-name">{0}</span> amb el rol <tt>from</tt> i la via <span class="object-name">{1}</span> amb el rol <tt>to</tt> es creuen al node <span class="object-name">{2}</span>. <p> Ambdues vies han de ser dividides al node de la intersecció.

source: The way <span class="object-name">{0}</span> with role <tt>{1}</tt> should be split at node <span class="object-name">{2}</span> where it connects to way <span class="object-name">{3}</span>.
ca_es: La via <span class="object-name">{0}</span> amb el rol <tt>{1}</tt> ha de ser dividida al node <span class="object-name">{2}</span> on s''interconnecta amb la via <span class="object-name">{3}</span>.

source: Split now
ca_es: Divideix ara
